#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.redirect_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Reading...
module.delete_lambda.data.archive_file.lambda: Reading...
module.delete_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.delete_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...
aws_api_gateway_rest_api.url_shortener_api: Refreshing state... [id=i2kdus2i80]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_dynamodb_table.urls: Refreshing state... [id=urls]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.delete_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_iam_policy_document.create_short_url_lambda: Reading...
data.aws_iam_policy_document.allow_get_url_lambda: Reading...
data.aws_iam_policy_document.allow_delete_url_lambda: Reading...
data.aws_iam_policy_document.allow_get_url_lambda: Read complete after 0s [id=2816463254]
data.aws_iam_policy_document.allow_delete_url_lambda: Read complete after 0s [id=3620161757]
data.aws_iam_policy_document.create_short_url_lambda: Read complete after 0s [id=2348542042]
module.delete_lambda.data.aws_iam_policy_document.policies: Reading...
module.redirect_lambda.data.aws_iam_policy_document.policies: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Reading...
module.redirect_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=4168244811]
module.delete_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=4168244811]
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=1299851198]
module.redirect_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=redirect-5178516-lambda-role]
module.delete_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=delete-url-5178516-lambda-role]
module.create_short_url_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=create-short-url-5178516-lambda-role]
aws_api_gateway_resource.redirect_resource: Refreshing state... [id=pgxnc5]
module.delete_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-i2kdus2i80-l9g1ngfv6l-DELETE]
module.post_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-i2kdus2i80-l9g1ngfv6l-POST]
module.redirect_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-i2kdus2i80-pgxnc5-GET]
module.delete_lambda.aws_lambda_function.lambda: Refreshing state... [id=delete-url-5178516]
module.redirect_lambda.aws_lambda_function.lambda: Refreshing state... [id=redirect-5178516]
module.create_short_url_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-short-url-5178516]
module.post_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-i2kdus2i80-l9g1ngfv6l-POST]
module.delete_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.post_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.delete_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-i2kdus2i80-l9g1ngfv6l-DELETE]
module.redirect_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.redirect_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-i2kdus2i80-pgxnc5-GET]
aws_api_gateway_deployment.url_shortener_api_deployment: Refreshing state... [id=vxvh5b]
aws_api_gateway_stage.live: Refreshing state... [id=ags-i2kdus2i80-live]
aws_api_gateway_usage_plan.usage: Refreshing state... [id=ukszus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.create_short_url_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/create-short-url-5178516-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-25T00:39:23Z" -> (known after apply)
      ~ id                    = "create-short-url-5178516-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "create-short-url-5178516-lambda-role" -> "create-short-url-1f03d2c-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT456JMDRPS2K" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.create_short_url_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url-5178516" -> (known after apply)
      ~ code_sha256                    = "R4MDljtgflQQ5lcPV9ksI/7y8vWvXCtnuHr/t7ky/8E=" -> (known after apply)
      ~ filename                       = "create-short-url-5178516_lambda_function_payload.zip" -> "create-short-url-1f03d2c_lambda_function_payload.zip"
      ~ function_name                  = "create-short-url-5178516" -> "create-short-url-1f03d2c" # forces replacement
      ~ id                             = "create-short-url-5178516" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-5178516/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-25T00:40:19.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url-5178516:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-5178516:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/create-short-url-5178516-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 1353 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/create-short-url-5178516" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.delete_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/delete-url-5178516-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-25T00:39:23Z" -> (known after apply)
      ~ id                    = "delete-url-5178516-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "delete-url-5178516-lambda-role" -> "delete-url-1f03d2c-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT456ICIPMEC5" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.delete_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:delete-url-5178516" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "delete-url-5178516_lambda_function_payload.zip" -> "delete-url-1f03d2c_lambda_function_payload.zip"
      ~ function_name                  = "delete-url-5178516" -> "delete-url-1f03d2c" # forces replacement
      ~ id                             = "delete-url-5178516" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-url-5178516/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-25T00:39:37.218+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:delete-url-5178516:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-url-5178516:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/delete-url-5178516-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/delete-url-5178516" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.delete_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-i2kdus2i80-l9g1ngfv6l-DELETE"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-url-5178516/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.delete_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "delete-url-5178516" -> "delete-url-1f03d2c" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.post_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-i2kdus2i80-l9g1ngfv6l-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-5178516/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.post_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "create-short-url-5178516" -> "create-short-url-1f03d2c" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.redirect_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/redirect-5178516-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-25T00:39:23Z" -> (known after apply)
      ~ id                    = "redirect-5178516-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "redirect-5178516-lambda-role" -> "redirect-1f03d2c-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45WHVQH4L6G" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redirect_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:redirect-5178516" -> (known after apply)
      ~ code_sha256                    = "IhsJUPgLuaIVAxkjEi0GvLwKX5gA1ESGfpuUb9X3/yQ=" -> (known after apply)
      ~ filename                       = "redirect-5178516_lambda_function_payload.zip" -> "redirect-1f03d2c_lambda_function_payload.zip"
      ~ function_name                  = "redirect-5178516" -> "redirect-1f03d2c" # forces replacement
      ~ id                             = "redirect-5178516" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-5178516/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-25T00:40:09.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:redirect-5178516:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-5178516:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/redirect-5178516-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 1238 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/redirect-5178516" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.redirect_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-i2kdus2i80-pgxnc5-GET"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-5178516/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.redirect_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "redirect-5178516" -> "redirect-1f03d2c" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 3 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @EsmerlinJM, Action: `pull_request`*